Catalogs/Города.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Города</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВРознице</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВПроизводстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКЛАДР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Города/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ФормаДобавитьИзКлассификатора.Доступность = ПравоДоступа("Добавление", Метаданные.Справочники.Города);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзКлассификатора(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьИзКлассификатораЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.Города.Форма.ФормаДобавленияИзКлассификатора", , , , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзКлассификатораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) ТОгда
		Возврат;
	КонецЕсли;
	
	ДобавитьИзКлассификатораСервер(Результат);
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Функция ДобавитьИзКлассификатораСервер(СтруктураРезультата)
	
	Справочники.Города.ДобавитьИзКлассификатора(СтруктураРезультата.Города, СтруктураРезультата.ИспользуетсяВРознице, СтруктураРезультата.ИспользуетсяВПроизводстве);

КонецФункции
